Shrunoti/Legto-MangOH-IoTHubConn/PSOC6_FreeRTOS+LwIP+MbedTLS_Azure-IOT-Hub-Demo/PSOC6_FreeRTOS+LwIP+MbedTLS_Azure-IOT-Hub-Demo.cydsn/codegentemp/UART_2.h
/***************************************************************************//**
* \file UART_2.h
* \version 2.0
*
*  This file provides constants and parameter values for the UART component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(UART_2_CY_SCB_UART_PDL_H)
#define UART_2_CY_SCB_UART_PDL_H

#include "cyfitter.h"
#include "scb/cy_scb_uart.h"

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*   Initial Parameter Constants
****************************************/

#define UART_2_DIRECTION  (3U)
#define UART_2_ENABLE_RTS (0U)
#define UART_2_ENABLE_CTS (0U)

/* UART direction enum */
#define UART_2_RX    (0x1U)
#define UART_2_TX    (0x2U)

#define UART_2_ENABLE_RX  (0UL != (UART_2_DIRECTION & UART_2_RX))
#define UART_2_ENABLE_TX  (0UL != (UART_2_DIRECTION & UART_2_TX))


/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_general
* @{
*/
/* Component specific functions. */
void UART_2_Start(void);

/* Basic functions */
__STATIC_INLINE cy_en_scb_uart_status_t UART_2_Init(cy_stc_scb_uart_config_t const *config);
__STATIC_INLINE void UART_2_DeInit(void);
__STATIC_INLINE void UART_2_Enable(void);
__STATIC_INLINE void UART_2_Disable(void);

/* Register callback. */
__STATIC_INLINE void UART_2_RegisterCallback(cy_cb_scb_uart_handle_events_t callback);

/* Configuration change. */
#if (UART_2_ENABLE_CTS)
__STATIC_INLINE void UART_2_EnableCts(void);
__STATIC_INLINE void UART_2_DisableCts(void);
#endif /* (UART_2_ENABLE_CTS) */

#if (UART_2_ENABLE_RTS)
__STATIC_INLINE void     UART_2_SetRtsFifoLevel(uint32_t level);
__STATIC_INLINE uint32_t UART_2_GetRtsFifoLevel(void);
#endif /* (UART_2_ENABLE_RTS) */

__STATIC_INLINE void UART_2_EnableSkipStart(void);
__STATIC_INLINE void UART_2_DisableSkipStart(void);

#if (UART_2_ENABLE_RX)
/* Low level: Receive direction. */
__STATIC_INLINE uint32_t UART_2_Get(void);
__STATIC_INLINE uint32_t UART_2_GetArray(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_2_GetArrayBlocking(void *buffer, uint32_t size);
__STATIC_INLINE uint32_t UART_2_GetRxFifoStatus(void);
__STATIC_INLINE void     UART_2_ClearRxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t UART_2_GetNumInRxFifo(void);
__STATIC_INLINE void     UART_2_ClearRxFifo(void);
#endif /* (UART_2_ENABLE_RX) */

#if (UART_2_ENABLE_TX)
/* Low level: Transmit direction. */
__STATIC_INLINE uint32_t UART_2_Put(uint32_t data);
__STATIC_INLINE uint32_t UART_2_PutArray(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_2_PutArrayBlocking(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_2_PutString(char_t const string[]);
__STATIC_INLINE void     UART_2_SendBreakBlocking(uint32_t breakWidth);
__STATIC_INLINE uint32_t UART_2_GetTxFifoStatus(void);
__STATIC_INLINE void     UART_2_ClearTxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t UART_2_GetNumInTxFifo(void);
__STATIC_INLINE bool     UART_2_IsTxComplete(void);
__STATIC_INLINE void     UART_2_ClearTxFifo(void);
#endif /* (UART_2_ENABLE_TX) */

#if (UART_2_ENABLE_RX)
/* High level: Ring buffer functions. */
__STATIC_INLINE void     UART_2_StartRingBuffer(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_2_StopRingBuffer(void);
__STATIC_INLINE void     UART_2_ClearRingBuffer(void);
__STATIC_INLINE uint32_t UART_2_GetNumInRingBuffer(void);

/* High level: Receive direction functions. */
__STATIC_INLINE cy_en_scb_uart_status_t UART_2_Receive(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_2_AbortReceive(void);
__STATIC_INLINE uint32_t UART_2_GetReceiveStatus(void);
__STATIC_INLINE uint32_t UART_2_GetNumReceived(void);
#endif /* (UART_2_ENABLE_RX) */

#if (UART_2_ENABLE_TX)
/* High level: Transmit direction functions. */
__STATIC_INLINE cy_en_scb_uart_status_t UART_2_Transmit(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_2_AbortTransmit(void);
__STATIC_INLINE uint32_t UART_2_GetTransmitStatus(void);
__STATIC_INLINE uint32_t UART_2_GetNumLeftToTransmit(void);
#endif /* (UART_2_ENABLE_TX) */

/* Interrupt handler */
__STATIC_INLINE void UART_2_Interrupt(void);
/** @} group_general */


/***************************************
*    Variables with External Linkage
***************************************/
/**
* \addtogroup group_globals
* @{
*/
extern uint8_t UART_2_initVar;
extern cy_stc_scb_uart_config_t const UART_2_config;
extern cy_stc_scb_uart_context_t UART_2_context;
/** @} group_globals */


/***************************************
*         Preprocessor Macros
***************************************/
/**
* \addtogroup group_macros
* @{
*/
/** The pointer to the base address of the hardware */
#define UART_2_HW     ((CySCB_Type *) UART_2_SCB__HW)
/** @} group_macros */


/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: UART_2_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_2_Init(cy_stc_scb_uart_config_t const *config)
{
   return Cy_SCB_UART_Init(UART_2_HW, config, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_DeInit(void)
{
    Cy_SCB_UART_DeInit(UART_2_HW);
}


