Shrunoti/Legto-MangOH-IoTHubConn/PSOC6_FreeRTOS+LwIP+MbedTLS_Azure-IOT-Hub-Demo/PSOC6_FreeRTOS+LwIP+MbedTLS_Azure-IOT-Hub-Demo.cydsn/codegentemp/UART_2.h
/*******************************************************************************
* Function Name: UART_2_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_Enable(void)
{
    Cy_SCB_UART_Enable(UART_2_HW);
}


/*******************************************************************************
* Function Name: UART_2_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_Disable(void)
{
    Cy_SCB_UART_Disable(UART_2_HW, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_RegisterCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_RegisterCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_RegisterCallback(cy_cb_scb_uart_handle_events_t callback)
{
    Cy_SCB_UART_RegisterCallback(UART_2_HW, callback, &UART_2_context);
}


#if (UART_2_ENABLE_CTS)
/*******************************************************************************
* Function Name: UART_2_EnableCts
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_EnableCts() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_EnableCts(void)
{
    Cy_SCB_UART_EnableCts(UART_2_HW);
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_DisableCts
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DisableCts() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_DisableCts(void)
{
    Cy_SCB_UART_DisableCts(UART_2_HW);
}
#endif /* (UART_2_ENABLE_CTS) */


#if (UART_2_ENABLE_RTS)
/*******************************************************************************
* Function Name: UART_2_SetRtsFifoLevel
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_SetRtsFifoLevel() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_SetRtsFifoLevel(uint32_t level)
{
    Cy_SCB_UART_SetRtsFifoLevel(UART_2_HW, level);
}


/*******************************************************************************
* Function Name: UART_2_GetRtsFifoLevel
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetRtsFifoLevel() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetRtsFifoLevel(void)
{
    return Cy_SCB_UART_GetRtsFifoLevel(UART_2_HW);
}
#endif /* (UART_2_ENABLE_RTS) */


/*******************************************************************************
* Function Name: UART_2_EnableSkipStart
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_EnableSkipStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_EnableSkipStart(void)
{
    Cy_SCB_UART_EnableSkipStart(UART_2_HW);
}


/*******************************************************************************
* Function Name: UART_2_DisableSkipStart
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DisableSkipStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_DisableSkipStart(void)
{
    Cy_SCB_UART_DisableSkipStart(UART_2_HW);
}


#if (UART_2_ENABLE_RX)
/*******************************************************************************
* Function Name: UART_2_Get
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Get() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_Get(void)
{
    return Cy_SCB_UART_Get(UART_2_HW);
}


/*******************************************************************************
* Function Name: UART_2_GetArray
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetArray() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetArray(void *buffer, uint32_t size)
{
    return Cy_SCB_UART_GetArray(UART_2_HW, buffer, size);
}


/*******************************************************************************
* Function Name: UART_2_GetArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetArrayBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_GetArrayBlocking(void *buffer, uint32_t size)
{
    Cy_SCB_UART_GetArrayBlocking(UART_2_HW, buffer, size);
}


/*******************************************************************************
* Function Name: UART_2_GetRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetRxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetRxFifoStatus(void)
{
    return Cy_SCB_UART_GetRxFifoStatus(UART_2_HW);
}


