Shrunoti/Legto-MangOH-IoTHubConn/PSOC6_FreeRTOS+LwIP+MbedTLS_Azure-IOT-Hub-Demo/PSOC6_FreeRTOS+LwIP+MbedTLS_Azure-IOT-Hub-Demo.cydsn/codegentemp/UART_2.h
/*******************************************************************************
* Function Name: UART_2_ClearRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_ClearRxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_UART_ClearRxFifoStatus(UART_2_HW, clearMask);
}


/*******************************************************************************
* Function Name: UART_2_GetNumInRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInRxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetNumInRxFifo(void)
{
    return Cy_SCB_UART_GetNumInRxFifo(UART_2_HW);
}


/*******************************************************************************
* Function Name: UART_2_ClearRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_ClearRxFifo(void)
{
    Cy_SCB_UART_ClearRxFifo(UART_2_HW);
}
#endif /* (UART_2_ENABLE_RX) */


#if (UART_2_ENABLE_TX)
/*******************************************************************************
* Function Name: UART_2_Put
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Put() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_Put(uint32_t data)
{
    return Cy_SCB_UART_Put(UART_2_HW,data);
}


/*******************************************************************************
* Function Name: UART_2_PutArray
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutArray() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_PutArray(void *buffer, uint32_t size)
{
    return Cy_SCB_UART_PutArray(UART_2_HW, buffer, size);
}


/*******************************************************************************
* Function Name: UART_2_PutArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutArrayBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_PutArrayBlocking(void *buffer, uint32_t size)
{
    Cy_SCB_UART_PutArrayBlocking(UART_2_HW, buffer, size);
}


/*******************************************************************************
* Function Name: UART_2_PutString
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutString() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_PutString(char_t const string[])
{
    Cy_SCB_UART_PutString(UART_2_HW, string);
}


/*******************************************************************************
* Function Name: UART_2_SendBreakBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_SendBreakBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_SendBreakBlocking(uint32_t breakWidth)
{
    Cy_SCB_UART_SendBreakBlocking(UART_2_HW, breakWidth);
}


/*******************************************************************************
* Function Name: UART_2_GetTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetTxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetTxFifoStatus(void)
{
    return Cy_SCB_UART_GetTxFifoStatus(UART_2_HW);
}


/*******************************************************************************
* Function Name: UART_2_ClearTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearTxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_ClearTxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_UART_ClearTxFifoStatus(UART_2_HW, clearMask);
}


/*******************************************************************************
* Function Name: UART_2_GetNumInTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInTxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetNumInTxFifo(void)
{
    return Cy_SCB_UART_GetNumInTxFifo(UART_2_HW);
}


/*******************************************************************************
* Function Name: UART_2_IsTxComplete
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_IsTxComplete() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool UART_2_IsTxComplete(void)
{
    return Cy_SCB_UART_IsTxComplete(UART_2_HW);
}


/*******************************************************************************
* Function Name: UART_2_ClearTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearTxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_ClearTxFifo(void)
{
    Cy_SCB_UART_ClearTxFifo(UART_2_HW);
}
#endif /* (UART_2_ENABLE_TX) */


#if (UART_2_ENABLE_RX)
/*******************************************************************************
* Function Name: UART_2_StartRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_StartRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_StartRingBuffer(void *buffer, uint32_t size)
{
    Cy_SCB_UART_StartRingBuffer(UART_2_HW, buffer, size, &UART_2_context);
}


