Shrunoti/Legto-MangOH-IoTHubConn/PSOC6_FreeRTOS+LwIP+MbedTLS_Azure-IOT-Hub-Demo/PSOC6_FreeRTOS+LwIP+MbedTLS_Azure-IOT-Hub-Demo.cydsn/codegentemp/UART_2.h
/*******************************************************************************
* Function Name: UART_2_StopRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_StopRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_StopRingBuffer(void)
{
    Cy_SCB_UART_StopRingBuffer(UART_2_HW, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_ClearRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_ClearRingBuffer(void)
{
    Cy_SCB_UART_ClearRingBuffer(UART_2_HW, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_GetNumInRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetNumInRingBuffer(void)
{
    return Cy_SCB_UART_GetNumInRingBuffer(UART_2_HW, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_Receive
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Receive() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_2_Receive(void *buffer, uint32_t size)
{
    return Cy_SCB_UART_Receive(UART_2_HW, buffer, size, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_GetReceiveStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetReceiveStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetReceiveStatus(void)
{
    return Cy_SCB_UART_GetReceiveStatus(UART_2_HW, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_AbortReceive
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_AbortReceive() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_AbortReceive(void)
{
    Cy_SCB_UART_AbortReceive(UART_2_HW, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_GetNumReceived
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumReceived() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetNumReceived(void)
{
    return Cy_SCB_UART_GetNumReceived(UART_2_HW, &UART_2_context);
}
#endif /* (UART_2_ENABLE_RX) */


#if (UART_2_ENABLE_TX)
/*******************************************************************************
* Function Name: UART_2_Transmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Transmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_2_Transmit(void *buffer, uint32_t size)
{
    return Cy_SCB_UART_Transmit(UART_2_HW, buffer, size, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_GetTransmitStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetTransmitStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetTransmitStatus(void)
{
    return Cy_SCB_UART_GetTransmitStatus(UART_2_HW, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_AbortTransmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_AbortTransmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_AbortTransmit(void)
{
    Cy_SCB_UART_AbortTransmit(UART_2_HW, &UART_2_context);
}


/*******************************************************************************
* Function Name: UART_2_GetNumLeftToTransmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumLeftToTransmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_2_GetNumLeftToTransmit(void)
{
    return Cy_SCB_UART_GetNumLeftToTransmit(UART_2_HW, &UART_2_context);
}
#endif /* (UART_2_ENABLE_TX) */


/*******************************************************************************
* Function Name: UART_2_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Interrupt() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_2_Interrupt(void)
{
    Cy_SCB_UART_Interrupt(UART_2_HW, &UART_2_context);
}

#if defined(__cplusplus)
}
#endif

#endif /* UART_2_CY_SCB_UART_PDL_H */


/* [] END OF FILE */
